In [1]:
import pandas as pd
import numpy as np

**Exercise 1:** Load dataset nyc_weather_2018 and weather_stations, then calculate the average
elevation of stations that calculat ‘SNOW’ and contains ‘NJ US’ in its name.

In [2]:
weather = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/nyc_weather_2018.csv')
station = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/weather_stations.csv')

In [3]:
station.head()

                  id                           name  ...  longitude  elevation
0  GHCND:US1CTFR0022        STAMFORD 2.6 SSW, CT US  ... -73.577000       36.6
1  GHCND:US1CTFR0039          STAMFORD 4.2 S, CT US  ... -73.568176        6.4
2  GHCND:US1NJBG0001      BERGENFIELD 0.3 SW, NJ US  ... -74.001983       20.1
3  GHCND:US1NJBG0002  SADDLE BROOK TWP 0.6 E, NJ US  ... -74.083358       16.8
4  GHCND:US1NJBG0003           TENAFLY 1.3 W, NJ US  ... -73.977500       21.6

[5 rows x 5 columns]

In [4]:
weather.shape

(78780, 5)

In [5]:
station.shape

(279, 5)

In [6]:
station.rename(columns= {'id':'station'}, inplace= True)
station.columns

Index(['station', 'name', 'latitude', 'longitude', 'elevation'], dtype='object')

In [7]:
weather_snow = weather[weather.datatype == 'SNOW']
weather_snow.head()

                   date datatype            station attributes  value
2   2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0015       ,,N,    0.0
4   2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0017       ,,N,    0.0
7   2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0018       ,,N,    0.0
10  2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0023       ,,N,    0.0
14  2018-01-01T00:00:00     SNOW  GHCND:US1NJBG0039       ,,N,    0.0

In [8]:
station_us = station[station.name.str.contains("NJ US")]
station_us.head()

             station                           name  ...  longitude  elevation
2  GHCND:US1NJBG0001      BERGENFIELD 0.3 SW, NJ US  ... -74.001983       20.1
3  GHCND:US1NJBG0002  SADDLE BROOK TWP 0.6 E, NJ US  ... -74.083358       16.8
4  GHCND:US1NJBG0003           TENAFLY 1.3 W, NJ US  ... -73.977500       21.6
5  GHCND:US1NJBG0005        WESTWOOD 0.8 ESE, NJ US  ... -74.015858       15.8
6  GHCND:US1NJBG0006            RAMSEY 0.6 E, NJ US  ... -74.134068      112.2

[5 rows x 5 columns]

In [9]:
data = weather_snow.merge(station_us, on ='station')
data.head()

                  date datatype  ... longitude elevation
0  2018-01-01T00:00:00     SNOW  ... -74.13979      17.7
1  2018-01-02T00:00:00     SNOW  ... -74.13979      17.7
2  2018-01-03T00:00:00     SNOW  ... -74.13979      17.7
3  2018-01-04T00:00:00     SNOW  ... -74.13979      17.7
4  2018-01-06T00:00:00     SNOW  ... -74.13979      17.7

[5 rows x 9 columns]

In [10]:
data.shape

(8347, 9)

In [11]:
data.drop_duplicates('station', inplace=True)
data.shape

(66, 9)

In [12]:
data.elevation.mean()

58.34848484848487

**Exercise 2:** Load the fb dataset, then:

• Calculate the percentage change between that and and last day in volumn (pct_change
method)

• Sort the dataframe by percentage change then get five days that have the biggest
change

In [13]:
fb = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/fb.csv')
fb.head()

         date        high         low        open       close    volume
0  2018-01-02  181.580002  177.550003  177.679993  181.419998  18151900
1  2018-01-03  184.779999  181.330002  181.880005  184.669998  16886600
2  2018-01-04  186.210007  184.100006  184.899994  184.330002  13880900
3  2018-01-05  186.899994  184.929993  185.589996  186.850006  13574500
4  2018-01-08  188.899994  186.330002  187.199997  188.279999  17994700

In [14]:
fb.shape

(251, 6)

In [15]:
fb=fb.assign(pct_change =lambda x: x.volume.pct_change())
fb.head()

         date        high         low  ...       close    volume  pct_change
0  2018-01-02  181.580002  177.550003  ...  181.419998  18151900         NaN
1  2018-01-03  184.779999  181.330002  ...  184.669998  16886600   -0.069706
2  2018-01-04  186.210007  184.100006  ...  184.330002  13880900   -0.177993
3  2018-01-05  186.899994  184.929993  ...  186.850006  13574500   -0.022073
4  2018-01-08  188.899994  186.330002  ...  188.279999  17994700    0.325625

[5 rows x 7 columns]

In [16]:
fb.sort_values(by='pct_change', ascending=True)
fb.head(n=5)

         date        high         low  ...       close    volume  pct_change
0  2018-01-02  181.580002  177.550003  ...  181.419998  18151900         NaN
1  2018-01-03  184.779999  181.330002  ...  184.669998  16886600   -0.069706
2  2018-01-04  186.210007  184.100006  ...  184.330002  13880900   -0.177993
3  2018-01-05  186.899994  184.929993  ...  186.850006  13574500   -0.022073
4  2018-01-08  188.899994  186.330002  ...  188.279999  17994700    0.325625

[5 rows x 7 columns]

**Exercise 3:** Create bins for each full number of earthquake magnitude (for instance, the first bin is (0,
1], the second is (1, 2], and so on) with the ml magnitude type and count how many are in
each bin.

In [17]:
data = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/earthquakes.csv')
data.head()

  alert  cdi  ...        updated                                                url
0   NaN  NaN  ...  1539475395144  https://earthquake.usgs.gov/earthquakes/eventp...
1   NaN  NaN  ...  1539475253925  https://earthquake.usgs.gov/earthquakes/eventp...
2   NaN  4.4  ...  1539536756176  https://earthquake.usgs.gov/earthquakes/eventp...
3   NaN  NaN  ...  1539475196167  https://earthquake.usgs.gov/earthquakes/eventp...
4   NaN  NaN  ...  1539477547926  https://earthquake.usgs.gov/earthquakes/eventp...

[5 rows x 26 columns]

In [18]:
newdata = data[data['magType'] == 'ml']
newdata.shape

(6803, 26)

In [19]:
newdata = newdata.assign(mag_bin= lambda x: pd.cut(x.mag, np.arange(0, 10)))
newdata.head()

  alert  cdi  ...                                                url mag_bin
0   NaN  NaN  ...  https://earthquake.usgs.gov/earthquakes/eventp...  (1, 2]
1   NaN  NaN  ...  https://earthquake.usgs.gov/earthquakes/eventp...  (1, 2]
2   NaN  4.4  ...  https://earthquake.usgs.gov/earthquakes/eventp...  (3, 4]
3   NaN  NaN  ...  https://earthquake.usgs.gov/earthquakes/eventp...  (0, 1]
6   NaN  NaN  ...  https://earthquake.usgs.gov/earthquakes/eventp...  (1, 2]

[5 rows x 27 columns]

In [20]:
newdata.mag_bin.value_counts()

(1, 2]    3105
(0, 1]    2207
(2, 3]     862
(3, 4]     122
(4, 5]       2
(5, 6]       1
(8, 9]       0
(7, 8]       0
(6, 7]       0
Name: mag_bin, dtype: int64

**Exercise 4:** Load the dataset weather_by_station then:

• Calculate the mean value each station recorded snow per month.

• Count the number of times each station recorded snow per month.

In [47]:
wbs = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/weather_by_station.csv',
                  index_col='date', parse_dates=True)
wbs.head()

           datatype            station  value                    station_name
date
2018-01-01     PRCP  GHCND:US1CTFR0039    0.0           STAMFORD 4.2 S, CT US
2018-01-01     PRCP  GHCND:US1NJBG0015    0.0  NORTH ARLINGTON 0.7 WNW, NJ US
2018-01-01     SNOW  GHCND:US1NJBG0015    0.0  NORTH ARLINGTON 0.7 WNW, NJ US
2018-01-01     PRCP  GHCND:US1NJBG0017    0.0        GLEN ROCK 0.7 SSE, NJ US
2018-01-01     SNOW  GHCND:US1NJBG0017    0.0        GLEN ROCK 0.7 SSE, NJ US

In [48]:
wbs.shape

(80256, 4)

In [62]:
snow_data = wbs[wbs['datatype'] == 'SNOW']
snow_data.head()

           datatype            station  value                    station_name
date
2018-01-01     SNOW  GHCND:US1NJBG0015    0.0  NORTH ARLINGTON 0.7 WNW, NJ US
2018-01-01     SNOW  GHCND:US1NJBG0017    0.0        GLEN ROCK 0.7 SSE, NJ US
2018-01-01     SNOW  GHCND:US1NJBG0018    0.0   PALISADES PARK 0.2 WNW, NJ US
2018-01-01     SNOW  GHCND:US1NJBG0023    0.0          OAKLAND 0.9 SSE, NJ US
2018-01-01     SNOW  GHCND:US1NJBG0039    0.0       RIVER EDGE 0.4 NNE, NJ US

In [72]:
snow_data.groupby(pd.Grouper(freq='M')).mean()

                value
date
2018-01-31   9.982520
2018-02-28   7.279635
2018-03-31  19.455325
2018-04-30   6.222798
2018-05-31   0.000000
2018-06-30   0.000000
2018-07-31   0.000000
2018-08-31   0.000000
2018-09-30   0.000000
2018-10-31   0.000000
2018-11-30   5.586513
2018-12-31   0.141079

In [73]:
pd.crosstab(index= snow_data.station_name, 
            columns= snow_data.index.month,
            colnames= ['month'],
            values= snow_data.value,
            aggfunc= lambda x: (x > 0).sum())

month                           1    2    3    4    5   ...   8    9    10   11   12
station_name                                            ...
ALBERTSON 0.2 SSE, NY US       3.0  1.0  3.0  1.0  0.0  ...  0.0  0.0  0.0  1.0  0.0
AMITYVILLE 0.1 WSW, NY US      1.0  0.0  1.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  0.0
AMITYVILLE 0.6 NNE, NY US      3.0  1.0  3.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  0.0
ARMONK 0.3 SE, NY US           6.0  4.0  6.0  3.0  0.0  ...  0.0  0.0  0.0  1.0  3.0
BLOOMINGDALE 0.7 SSE, NJ US    2.0  1.0  3.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  1.0
...                            ...  ...  ...  ...  ...  ...  ...  ...  ...  ...  ...
WEST NYACK 1.3 WSW, NY US      3.0  1.0  5.0  1.0  NaN  ...  NaN  NaN  NaN  1.0  NaN
WESTFIELD 0.6 NE, NJ US        3.0  0.0  4.0  1.0  0.0  ...  0.0  0.0  NaN  1.0  NaN
WOODBRIDGE TWP 1.1 ESE, NJ US  4.0  1.0  3.0  2.0  0.0  ...  0.0  0.0  0.0  1.0  0.0
WOODBRIDGE TWP 1.1 NNE, NJ US  2.0  1.0  3.0  0.0  0.0  ...  0.0  0.0  0.0  1.0  0.0
WOODBRIDGE TWP 3.0 NNW, NJ US  NaN  0.0  0.0  NaN  NaN  ...  NaN  NaN  0.0  0.0  NaN

[98 rows x 12 columns]